[
    {"format":1,
     "iso":"DZA",
     "country":"Algeria",
     "upcoming":"- 2013: Council of the Nation",
     "recent":"- May 10, 2012: Legislative",
     "current_hos":"President Abdelaziz Bouteflika (assumed office April 27, 1999 (3rd term))",
     "current_hog":"Prime Minister Ahmed Ouyahia (assumed office 23-Jun-08)",
     "description":"After a November 2008 constitutional amendment that eliminated presidential term limit, President Abdelaziz Bouteflika was reelected for a third term in April 2009, with 90.2% of the vote and 74.5% of official participation; figures which were considered too high to be credible. The next presidential election is scheduled for 2014, and President Bouteflika is not expected to run again due to poor health. On May 10, 2012, Algerians went to the polls to elect their People's National Assembly's 462 members. The elections followed massive youth riots in December 2010 and early 2011, fuelled by increases in the price of cooking oil and sugar as well as other commodities. The riots, which quickly turned to anti-government protests, led President Bouteflika to initiate reforms aimed at increasing democratic representation, and revising laws on elections, the media and political parties. The legal reform process is due to be completed after the elections with the amendment of the Constitution. Over 21 million Algerians registered to vote for 44 political parties, half of which were only legalized this year as part of the government's reforms. The ruling National Liberation Front (NLF), which has dominated the country's political life since Algeria won independence from France in 1962, was expected to retain the majority, with more seats anticipated to go to a coalition of Islamist parties including Algeria's Hamas, Al-Islah, and Ennahda Party competing under the umbrella of the Green Alliance. 42.9% of eligible voters came out to vote, a rate higher than expected, and an improvement on the 35% turnout of the May 2007 parliamentary elections. Voters abstained due to mistrust and misgivings, many doubting there would be real change. For most Algerians, voting is a futile effort since real power lies with an informal network that has its roots in the country's security forces. The elections were monitored by the National Commission for the Monitoring of the Legislative Elections, alongside a large number of foreign observers who included the European Union, the Arab League, the Carter Centre, the National Democratic Institute, and two hundred observers from the African Union. The observers declared the vote satisfactory. It was judged one of the freest and most transparent elections in Algeria's history. As anticipated, NLF won a grand total of 220 seats increasing its majority from 34 to 47%. Prime Minister Ahmed Ouyahia's National Democratic Rally (RND) came second with 68 seats, and the Islamist Green Alliance won 59 seats, one seat less than in 2007. After the adoption of a November 2011 law that improved female representation in politics, the polls also saw the election of 145 women in the new Assembly, increasing from 30 in the previous legislature or from 7 to 31.39%. Unlike recent elections in Tunisia, Egypt and Morocco, the Algerian vote did not confirm the rise of Islamist parties. President Bouteflika will, in the coming days, appoint a new prime minister. Following FLN's victory, its leader Abdelaziz Belkhadem, who served as prime minister from 2006-2008, appears to be the leading candidate for the job."
    },
    {"format":0,
     "iso":"AGO",
     "country":"Angola",
     "upcoming":"",
     "recent":"- August 31, 2012: Parliamentary",
     "current_hos":"President Jose Eduardo dos Santos (assumed office September 10, 1979 (3rd term))",
     "current_hog":"n/a",
     "description":"The ruling Popular Movement for the Liberation of Angola (MPLA) has been in power since independence in 1975. The previous legislative election in 2008 was the first one since the 1992 polls which led to the resumption of civil war that ended in 2002. MPLA won a landslide victory with about 82% of the vote, with the main opposition party - the National Union for the Total Independence of Angola (UNITA) - winning 10%. A new constitution was enacted in February 2010, which abolishes direct election of the President. The President will be the head of the party that earns the most votes in parliamentary elections. The 2010 constitution also introduced the new office of the vice president, and eliminated the position of prime minister."
    },
    {"format":0,
     "iso":"BEN",
     "country":"Benin",
     "upcoming":"",
     "recent":"- March 13, 2011: Presidential<br>- April 30, 2011: National Assembly",
     "current_hos":"President Yayi Boni (assumed office April 6, 2006 (2nd term))",
     "current_hog":"Prime Minister Pascal Koupaki (assumed office 11-May-12)",
     "description":"President Yayi Boni was reelected for a second term in March 2011 with 53.13% of the votes, after voter registration problems forced postponement twice. Though the results were disputed by the main opposition leader, Benin is among West Africa??s most stable countries, due to peaceful power alternations and frequent multiparty free and fair elections. In April 2011, Mr Yayi consolidated his presidential victory when supporters won a strong working majority in legislative elections. Mr Yayi's own party, Cauris Forces for an Emerging Benin (Forces Cauris pour un Benin Emergent), won 41 of the 83 seats in the National Assembly. Two smaller parties, also supporters of Mr Yayi during the campaign, won two seats each. In addition, some opposition parties, including Renaissance du Benin (RB), part of the wider Union fait la Nation (UN) alliance which won 30 seats, decided to support Mr Yayi in parliament. This decision caused internal dissent within RB, calling into questoin the political future of Adrien Houngbedji, the defeated presidential candidate and leader of the Parti du Renouveau Democratique."
    },
    {"format":0,
     "iso":"BFA",
     "country":"Burkina Faso",
     "upcoming":"",
     "recent":"- December 2012: Legislative",
     "current_hos":"President Blaise Compaore (assumed office October 15, 1987 (5th term))",
     "current_hog":"Prime Minister Luc Adolphe Tiao (assumed office 18-Apr-11)",
     "description":"The 2007 parliamentary election was considered generally free and orderly despite irregularities. In November 2010, President Compaore, who took power in a coup 24 years earlier, was re-elected to a fourth term with more than 80% of the vote. However, since February 2011 disgruntled soldiers have been protesting violently for higher wages, in addition to trade unions and civil society groups demonstrating against the escalating cost of living. President Compaore responded by promising them a range of benefits, firing his security chiefs in April. . Burkina Faso's strained resources were also affected by the post-election crisis in neighboring Cote d'Ivoire and the subsequent arrival of returnees and Ivorian refugees."
    },
    {"format":0,
     "iso":"CMR",
     "country":"Cameroon",
     "upcoming":"",
     "recent":"- October 9, 2011: Presidential<br>- July 8, 2012: Legislative (postponed)",
     "current_hos":"President Paul Biya (assumed office November 6, 1982 (6th term))",
     "current_hog":"Prime Minister Philemon Yang (assumed office 30-Jun-09)",
     "description":"President Paul Biya has been in power since 1982. In 1996, constitutional revisions created an upper chamber for the legislature, a decentralized system of regional government, and a Constitutional Court. However, none of these provisions have been implemented. In 2007, the last legislative and municipal elections were considered significantly flawed with deficiencies including barriers to registration and inadequate safeguards against fraudulent voting. The ruling Cameroon People's Democratic Movement (CPDM) won a large majority of the National Assembly 180 seats at 153, while the Social Democratic Front (SDF), the main opposition party, won 16 seats. In 2008, the National Assembly abolished the 1996 two-term presidential limit in the constitution, allowing President Biya to stand for reelection in October 2011. 7.5 million Cameroonians registered to choose among 23 candidates who ran for the October 9 presidential election. The run up to the elections was marred by pockets of violence, protests and arrests. With firm control on the process, President Biya had arranged crucial dates on the election calendar and nominated members of the national election body, one of who was later dismissed for campaigning for the incumbent. Overall, the vote was conducted peacefully, despite allegations of fraud and the killing of three people including two gendarmes in the oil-rich Bakassi peninsula. Following the vote, seven opposition candidates filed a petition with the Supreme Court acting as the Constitutional Council to cancel the election and call for a new one within six months. The court dismissed the petition and President Biya was declared winner of the election with over 77.9% of the vote, extending his 29-year rule for another seven years. The main opposition candidate, John Fru Ndi from the SFD secured close to 11% of the vote."
    },
    {"format":0,
     "iso":"CPV",
     "country":"Cape Verde",
     "upcoming":"",
     "recent":"- February 6, 2011: Parliamentary<br>- August 7, 2011: Presidential<br>- August 21, 2011: Presidential",
     "current_hos":"President Jorge Carlos Fonseca (assumed office September 9, 2011 (1st term))",
     "current_hog":"Prime Minister Jose Maria Neves (assumed office 1-Feb-11)",
     "description":"Cape Verde is a multiparty parliamentary democracy in which constitutional powers are shared between the elected president and the prime minister. The legislative election in February 2011 was considered free and fair. The African Party for the Independence of Cape Verde (PAICV), which has been in power since 2001, won 37 out of the 72 National Assembly seats. After two terms and his re-election in 2006 with 50.98%, President Pedro Pires was prohibited from running for a third term in August 2011. Manuel Inocencio Sousa, the candidate for the ruling PAICV, faced less support since former National Assembly president, Aristides Raimundo Lima, also of the PAICV, stood as an independent. This division boosted the chances of former foreign minister and law professor Jorge Carlos Fonseca from the main opposition party, Movement for Democracy (MFD), who won the election in the second round with 54.16% to 45.84% against Manuel Inocencio Sousa."
    },
    {"format":0,
     "iso":"CAF",
     "country":"Central African Repbulic",
     "upcoming":"",
     "recent":"- January 23, 2011: Presidential/National Assembly, 1st round<br>- March 27, 2011: National Assembly, 2nd round",
     "current_hos":"President Francois Boziz (assumed office March 15, 2003 (2nd term))",
     "current_hog":"Prime Minister Faustin-Archange Touadera (assumed office 22-Jan-11)",
     "description":"President Bozize seized power in 2003, after a military coup overthrewing then President  Ange-Felix Patasse. In December 2004 a new constitution passed by referendum and the country held elections in 2005. Initially planned for April 2010, presidential and legislative elections were postponed four times before finally taking place in January 2011. The National Assembly passed a law authorizing President Bozize to remain in power until elections were held. The government blamed the postponement on inadequate funding and the security situation in the country. In January 2011, President Bozize was re-elected with 64.37% of the votes cast in the first round of the presidential elections. The National Convergence <q>Kwa Na Kwa</q> (<q>Work, only work</q>) and its allies supporting President Bozize took over 70 of the 105 National Assembly seats, as the polls were boycotted by the opposition."
    },
    {"format":0,
     "iso":"TCD",
     "country":"Chad",
     "upcoming":"",
     "recent":"- February 13, 2011: Legislative<br>- April 25, 2011: Presidential",
     "current_hos":"President Idriss Deby (assumed office December 2, 1990 (4th term))",
     "current_hog":"Prime Minister Emmanuel Nadingar (assumed office 5-Mar-10)",
     "description":"President Idriss Deby siezed power by coup in 1990 and staved off two attempted coups in 2006 and 2008. Having removed term limits from the country's constitution in June 2005, he ran for a 4th term in April 2011 and won the election with 88.6% of the vote. His two rivals were the Agriculture and Irrigation Minister and leader of the pro-government Rassemblement national pour la democratie au Tchad (RNDT)-Reveil, Albert Pahimi Padacke and Nadji Madou, leader of the Alliance Socialiste pour un Renouveau Integral. Key opposition leaders boycotted the election due to allegations of fraud and misconduct surrounding the contested parliamentary elections held in February 2011. President Deby??s Patriotic Salvation Movement (MPS) won an absolute majority in parliament against a fragmented and underfunded opposition."
    },
    {"format":0,
     "iso":"COG",
     "country":"Republic of the Congo",
     "upcoming":"",
     "recent":"- July 15, 2012: Legislative (1st round)<br>- August 5, 2012: Legislative (2nd round)<br>- November 2012: Sub national/Legislative",
     "current_hos":"President Joseph Kabila (assumed office January 26, 2011 (2nd term))",
     "current_hog":"Prime Minister Adolphe Muzito (assumed office 10-Oct-08)",
     "description":"Congolese went to the polls, first on July 15, to elect the members of their 139-seat National Assembly. More than two million eligible voters were expected to choose among four main parties, including the Congolese Party of Labour (PCT) led by President Denis Sassou Nguesso; the Congolese Movement for Democracy and Integral Development (MCDDI); the Union for Democracy and the Republic; and the Pan-African Union for Social Democracy (UPADS). Over 1,200 candidates, including 124 women, competed for 136 seats, as voting did not take place in three constituencies in the city of Brazzaville, where an explosion at an arms depot killed 300 people and left over 17,000 people homeless in March 2012. Ahead of the elections, independent media denounced the inflated number of candidates, alleging that for every fifteen candidates, at least thirteen were openly supporting the government. Such multiplication of candidates was seen as to increase the ruling party's chances to win seats in the Assembly, but also to accumulate electoral funds. The first round gave the ruling PCT 57 seats, including for two children of President Sassou Nguesso, while its allies won 10 seats. Opposition parties, the Union for Democracy and the Republic and UPADS only secured one seat each. The second round of the elections began on August 5, with a total of 140 candidates contesting in 67 constituencies where no candidate had obtained a majority. As for the first round, voting was conducted without any major incident despite limited participation and isolated violence in the South. In the absence of official figures from the national electoral commission, civil society organizations estimated at 15% only, the participation rate. The ruling PCT won additional 32 seats. Independent candidates close to the PCT won 12 seats, and UPADS, the main opposition party, took only seven seats as opposed to 11 in the outgoing legislature. Monitored by some 60 international observers, the vote was marked by accusations of irregularities and fraud from the opposition. Final results gave the PCT a majority of 89 out of the 136 seats. With its allies, the ruling party controls a total of 117 seats in the National Assembly. Ten women only were elected, against 13 in the previous legislature. Analysts denounced the weakness of the 2007 electoral law promoting women's representation in Parliament (which sets for 15% women representation in legislative elections), as well as the reluctance of political parties to promote female candidates. The National Assembly in Congo has been dominated by the ruling PCT since 2002. President Denis Sassou-Nguesso, 68, first held power between 1979 and 1992, when his Congolese Labor Party lost elections to Pascal Lissouba. In 2009, President Sassou-Nguesso was re-elected with 78.6% of the vote under the banner of a new coalition, the Rally of the Presidential Majority (RMP). His party's victory at the recent legislative election is seen as an authorization to pursue his mandate. For the opposition, this victory opens the door to an amendment of the 2002 constitution, which prohibits President Sassou-Nguesso to run for re-election in 2016."
    },
    {"format":0,
     "iso":"COD",
     "country":"Democratic Republic of the Congo",
     "upcoming":"",
     "recent":"- November 28, 2011: Presidential/Legislative (National Assembly)<br>- June 2012: Legislative (Senate)",
     "current_hos":"President Joseph Kabila (assumed office January 26, 2001 (2nd term))",
     "current_hog":"Prime Minister Adolphe Muzito (assumed office 10-Oct-08)",
     "description":"President Joseph Kabila acceded to the presidency following the assassination of his father, Laurent, in January 2001. He was first elected in October 2006 with 58.05% of the vote in the first democratic vote after 41 years. Strongly supported by the international community, the elections were considered the most complex and the most expensive organized by the United Nations. In January 2011, supposedly to prevent the type of violence that marred the end of the 2006 election and which opposed President Kabila's supporters to those of the opposition candidate Jean Pierre Bemba, the government proposed laws abolishing the second round of the presidential election, and changing proportional into majority representation. These changes were criticized by opposition political parties, which denounced the organization of electoral fraud on a large scale. Continuing tension in the Eastern and Northeastern regions, and a February 2011 attack against President Kabila's residence in the capital Kinshasa reinforced fears of instability in the run-up to the November 2011 elections. Both presidential and parliamentary elections were held on November 28. Of the 32 million registered voters, nearly 19 million Congolese went out to vote; in about 64,000 polling stations open nationwide; for a total of 186,000 ballot boxes. Eleven candidates competed for the presidential seat, and close to 19,000 candidates ran for the 500 National Assembly seats. The election, Congo's first locally organized vote, was meant to strengthen the country's stability and encourage foreign investment after years of conflict. Instead, it heightened tension and deepened divisions. Due to localized violence which resulted in voter intimidation, logistical challenges and numerous irregularities such as thousands of ballots missing and impossibly high votes for the incumbent, international observers voiced serious concern about the credibility of the polls. President Joseph Kabila, 40, was declared winner with 48.95% of the vote, against 32.33% to his main opponent, Etienne Tshisekedi of Union for Democracy and Social Progress (UDPS) party. Though the results were ratified by the Supreme Court, Etienne Tshisekedi declared himself president; while approximately 20 of his supporters were reported killed in clashes with the police. President Kabila admitted there were mistakes with the election but these did not affect the ultimate outcome. The electoral commission released the results of the parliamentary election at the end of January 2012, two months after the disputed elections. President Kabila's People's Party for Reconstruction and Democracy (PPRD) lost 45% of the legislative seats it held before the November elections, according to results announced by the national electoral commission. Nevertheless, PPRD and its allies still control a majority of about 260 seats, while the opposition took about 110 seats. Some 100 parties will be represented in the new parliament, many with just one or two seats, and with no official alliance with either camp. International and local observers have declared the election flawed and Etienne Tshisekedi has called for a boycott of parliament."
    },
    {"format":1,
     "iso":"DJI",
     "country":"Djibouti",
     "upcoming":"- 2013: National Assembly",
     "recent":"- 2011: Regional assemblies and local<br>- April 8, 2011: Presidential",
     "current_hos":"President Ismail Omar Guelleh (assumed office May 8, 1999 (3rd term))",
     "current_hog":"Prime Minister Dileita Mohamed Dileita (assumed office 7-Mar-01)",
     "description":"In April 2011, Djibouti held its third presidential election since its independence in 1977. While the Constitution dictates a two-term presidential limit, the National Assembly amended the Constitution in April 2010, to allow President Guelleh to stand for a third term. Boycotted by the opposition, the April 2011 election was largely peaceful despite fears following antigovernment protests in February. President Guelleh was re-elected with over 80% of the vote against former Constitutional Court President Mohammed Warsama Ragueh who ran as an independent candidate. The unicameral Chamber of Deputies is comprised of 65 members elected for a five-year term in multiparty election. In 2008, the opposition coalition Union for a Democratic Alternative (UAD) boycotted the legislative election. As a consequence the National Assembly is now dominated by President Guelleh's party, the People's Rally for Progress (RPP), which holds the totality of the seats. Despite its relative stability in the volatile region of the Horn of Africa, Djibouti has a long history of weak opposition parties which have failed to draw broad support. The opposition?s lack of leadership and of a coherent political culture continues to impact negatively on the country?s democratic process ahead of the tentative regional and local elections."
    },
    {"format":0,
     "iso":"EGY",
     "country":"Egypt",
     "upcoming":"",
     "recent":"- May 24-25, 2012: Presidential (first round)<br>- June 16-17, 2012: Presidential (second round)<br>- November 28, 2011: Parliamentary (1st round)<br>- December 6, 2011: Parliamentary (2nd round)<br>- January 3, 2012: Parliamentary (3rd round)<br>- January 22, 2012: Legislative(1st round)",
     "current_hos":"President a.i.Mohamed Hussein Tantawi (assumed office February 11, 2011 (1st term))",
     "current_hog":"Prime Minister Kamal al-Ganzouri (assumed office 7-Dec-11)",
     "description":"The first round of the presidential election was held on the 23rd and 24th of May, 2012 with four major contenders. For the the first time in thirty years, the Egyptians will conduct an election without knowing beforehand the candidate that will emerge as the winner. None of the four major contenders was able to secure the required 50 percent majority to win the election out rightly. It is expected that the election runoff will hold on June 16-17, 2012 between Mohammed Mursi of the Brotherhood's Freedom and Justice Party and Ahmed Shafiq, a former prime minister, and unabashed supporter of the regime of former President Hosni Mubarak. The runoff election will be the most polarized that could be imagined of the two-stage contest and further constitute a deep dilemma for the Egyptian people. Shafiq is seen as a secular figure and a remnant of the old regime of Mubarak while Mursi has repeated promised to implement Islamic law if elected. Mursi has also called for a review of the 1979 peace treaty with Israel saying that Israel did not respect the accord, though the Brotherhood stated that they would not renege on the accord. During the election, it was alleged that there were massive rigging of votes and that about 600,000 police and troops voted for Shafiq. The electoral commission rejected the complaints after recounting the votes. On the announcement of the result which saw a tie between Mursi and Shafiq, hundreds of demonstrators took to Cairo's iconic Tahrir Square to rally against Shafiq and a group of protesters set fire on Shafiq's campaign headquarters in Cairo. A major twist to the election was the defeat of Amr Moussa, former Secretary-General of the Arab League, who was initially the front running stability' candidate at the beginning of the election but was only able to win 10.9 per cent of the total votes cast. He has however stated that he would not support any of the two candidates going for the runoff elections. A political party also rejected the two candidates on the ground that the party is against the Muslim Brotherhood dominating the country the Brotherhood already dominates the parliament, and it is totally against the notion of handling power over to remnants of the old Mubarak regime. The turnout for this election was pegged at 42 percent and it is even anticipated that many voters will abstain from voting in the runoff election. The outcome of the election showed that the people are searching for a credible third alternative for those that fear the imposition of a religious state by the Brotherhood if they win the election and those that do not want any remnant of Mubarak regime to take power. The Brotherhood has struggled politically since they won the parliamentary elections and even lost the support of some of its members after appearing as power-hungry and self-serving. During the first phase of the election, Mursi sought popular support by appealing to conservative Muslim voters with promises of Shariah and stringent family values. The question that lingers is if the Brotherhood's political machine can convince voters that Mursi will represent the Egyptian people and not just the Muslim Brotherhood since no one can fathom what the Brotherhood would do once they are in power. It is apparent that Egypt had a free election but it seems the demand of Egypt revolutionaries has not been met. Definitely, the Egyptian revolution still has a long way to go until it achieves true power."
    },
    {"format":1,
     "iso":"GNQ",
     "country":"Equatorial Guinea",
     "upcoming":"- 2013: House of Peoples' Representatives and local",
     "recent":"- 2012: Parliamentary",
     "current_hos":"President Teodoro Obiang Nguema Mbasogo (assumed office August 3, 1979 (6th term))",
     "current_hog":"Prime Minister Ignacio Milam Tang (assumed office 8-Jul-08)",
     "description":"President Obiang Nguema Mbasogo has ruled Equatorial Guinea since seizing power in a military coup in 1979. Multiparty elections were introduced in 1991. However, international electoral observers have reported significant flaws in elections regularly. President Obiang has won more than 95% of the vote in every presidential election and was reelected in 2009 with 95.37% of the vote. While Equatorial Guinea's per capita gross domestic product is among the highest in the world, and the highest in sub-Saharan Africa, 75% of the population lives on less than $1 a day."
    },
    {"format":1,
     "iso":"ETH",
     "country":"Ethiopia",
     "upcoming":"- 2013: President (indirect), House of the Federation and local",
     "recent":"",
     "current_hos":"President Girma Wolde-Giorgis (assumed office October 8, 2011 (2nd term))",
     "current_hog":"Prime Minister Meles Zenawi (assumed office 23-Aug-95",
     "description":"n/a"
    },
    {"format":0,
     "iso":"GAB",
     "country":"Gabon",
     "upcoming":"",
     "recent":"- December 17, 2011: Legislative",
     "current_hos":"President Ali Ben Bongo (assumed office October 16, 2009 (1st term))",
     "current_hog":"Prime Minister Paul Biyoghe Mba (assumed office 17-Jul-09)",
     "description":"The ruling Democratic Party of Gabon (PDG) has held power since 1968. Following the death of former President Omar Bongo Odimba in June 2009 after 41 years in power, his son, Ali Ben Bongo was elected president in August 2009 with 41.7% of the vote. The election sparked violent protests in the country. The Parliament is comprised of a 102-seat Senate whose members are elected indirectly to serve six-year terms; and a120-seat National Assembly, whose members are elected by direct and popular vote to serve five-year terms. National Assembly elections were held on December 17, 2011. The elections, the first legislative poll since Omar Bongo died in 2009, followed a decision of the Constitutional Court rejecting a Government request to postpone the election for one year, to allow the introduction of biometrics in the countrys electoral system. The request stemmed from an agreement between leaders of political parties and civil societies, and President Ali Bongo, to postpone the legislative elections. In protest of the Courts decision, thirteen opposition parties decided to pull out of the electoral commission, accusing the Executive of going back on the initially agreed postponement. In the previous Assembly, President Ali Bongos PDG and its supporters held a comfortable majority of 98 seats and were not expected to lose much ground against a splintered opposition. A total of 746,000 people were registered to vote, in a country of 1.5 million inhabitants. Though official numbers were not available, voter turnout was estimated low, hovering between 10 and 40% according to poll officials. PDG claimed it had won an absolute majority, securing 114 of the Assembly 120 seats. Despite the opposition boycott, the election was found credible, generally well organized and carried without any major incidents. However, the opposition has threatened not to recognize the validity of the election."
    },
    {"format":0,
     "iso":"GMB",
     "country":"The Gambia",
     "upcoming":"",
     "recent":"- March 29, 2012: Legislative<br>- November 24, 2011: Presidential",
     "current_hos":"President Yahya Jammeh (assumed office July 22, 1994 (4th term))",
     "current_hog":"n/a",
     "description":"President Yahya Jammeh seized power in a bloodless military coup in 1994. Since then, the Gambia has been relatively stable. Ahead of the November 2011 elections, the 46-year-old former military officer had declared his victory a foregone conclusion and threatened to suspend development projects in areas supporting the opposition. Besides Jammeh's Alliance for Patriotic Reorientation and Construction (APRC), five opposition parties took part in the elections, including the United Democratic Party (UDP), the main opposition party led by Ousainou Darboe. 83% of the 800 000 registered voters went to a poll where, due to high illiteracy rates, voters cast their ballot by putting a glass marble into a colored drum representing their candidate. Scoring a landslide 72% victory by winning all 48 constituencies, President Jammeh secured a fourth term in office, extending his 17-year rule. His closest rival Ousainou Darboe obtained 17% of the vote. In third position, Amath Bah of National Reconciliation Party (NRP) secured 11% of the vote. One of Africa's most controversial rulers, President Jammeh is regularly criticized for human rights abuses and press muzzling. In 2007, he claimed he had invented a cure for AIDS. In 2008, he ordered all homosexuals to leave the country. And in July 2011, he affirmed ruling thanks to divine intervention, assuring that neither a vote nor a coup could oust him. ECOWAS decided not to send an observer mission to the Gambia, following a fact-finding mission which concluded that repression and intimidation had prevented the conduct of free and fair elections. For the African Union observer mission, deep media bias and unequal financial and material capability strongly favored the incumbent. While his critics note that the Gambia remains in dire poverty, President Jammeh and his supporters claim he has helped improve the country's infrastructure, education and health care. The Gambia has a unicameral National Assembly of 53 members serving 5-year terms. Five members of the Assembly are appointed by the president. The APRC won 42 of the eligible seats at the last legislative election in 2007. On March 29, 2012, Gambian voted in the countrys fourth National Assembly Election since 2007. Six out of seven opposition parties to the ruling Alliance for Patriotic Reorientation and Construction (APRC) decided to boycott the elections after their appeal to postpone them was rejected. The opposition accused APRC of monopolizing state resources and using the state media to unfairly influence the election outcome. With half of the country's 48 constituencies left unchallenged due to the boycott, voters did not have many options to choose from. ECOWAS refused to monitor the elections after observing that the situation was not conducive to a <q>free, fair and transparent</q> poll. The elections were monitored by other institutions including the African Union, the Commonwealth and the Organization of Islamic Conference. The AU observer mission concluded that the vote was generally peaceful and lawful. However, the AU mission also deplored irregularities including the opposition boycott, cases of intimidation, a gross imbalance in the financial means of the incumbent and his challengers, and the uneven allocation of public funds. Over 300,000 of 700,000 eligible voters went to vote. Of the 48 seats opened for election, the ruling APRC received the majority of the votes, capturing 43 seats; the National Reconciliation Party received took 1 seat in the National Assembly; and the Independents won 4 seats."
    },
    {"format":0,
     "iso":"GHA",
     "country":"Ghana",
     "upcoming":"",
     "recent":"- December 7, 2012: Presidential (first round)<br>- December 28, 2012: Presidential (second round)/Legislative",
     "current_hos":"President John Atta Mills  (assumed office January 7, 2009 (1st term))",
     "current_hog":"n/a",
     "description":"Ghana is a constitutional democracy with a strong presidency and a unicameral parliament. The last elections in 2008 were found transparent and relatively peaceful. The presidential run-off election saw the victory of then opposition National Democratic Congress (NDC) both at the presidency and in parliament. President John Atta Mills was elected with a margin of less than one percent at 50.23% against New Patriotic Party (NPP)'s candidate Nana Akufo-Addo who won 49.77% of the vote. The December 2012 presidential election will be a repeat of the 2008 vote. President Mills has already been selected as the presidential candidate for the ruling NDC, and Nana Akufo Addo was designated as NPP's presidential candidate. The last parliamentary election, also in 2008, saw the ruling NCD win 115 of the 230 seats, closely followed by the NPP with 108 seats."
    },
    {"format":0,
     "iso":"GIN",
     "country":"Guinea",
     "upcoming":"",
     "recent":"- 2012 (postponed): National Assembly",
     "current_hos":"President Alpha Conde (assumed office December 21, 2010 (1st term))",
     "current_hog":"Prime Minister Mohamed Said Fofana (assumed office 24-Dec-10)",
     "description":"Since the death of 24-year President Lansana Conte in December 2008, Guinea has endured successively a military coup, the violent repression of a peaceful pro-democracy rally in September 2009, the assination attempt and shooting of the junta's leader, Captain Moussa Dadis Camara, in December 2009, and the first democratic election since the 1958 independence. Amid violence and ethnically-charged tension, the November 2010 presidential run-off saw the victory of long-term opposition leader Alpha Cond_ of the Rally of the Guinean People Party (RGP). He defeated former prime minister Cellou Dalein Diallo of the Union of Democratic Forces of Guinea (UFDG) by 52 to 48% of the vote. Though widely considered democratic, inclusive and transparent, the election led to several weeks of instability. Guinea's last National Assembly elections were held in 2002. Legislative elections, previously scheduled for June 2007, were repeatedly delayed and the Assembly was dissolved in December 2008, and replaced by a National Transition Council. The election for the new assembly was scheduled to take place within six months of the presidential election and was once again delayed. Despite simmering political tensions and an assassination attempt on President Alpha Cond_ in July 2011, the government has promised to hold the legislative election by the end of the year. Opposition political parties, namely the UFDG, have objected to a government-led census ahead of the planned election. However, the election was again postponed early December, due to poor organization and security concerns."
    },
    {"format":0,
     "iso":"GNB",
     "country":"Guinea-Bissau",
     "upcoming":"",
     "recent":"- 2012: Parliamentary",
     "current_hos":"President Malam Bacai Sanhi (assumed office September 8, 2009 (1st term))",
     "current_hog":"Prime Minister Carlos Gomes Junior (assumed office 2-Jan-09)",
     "description":"Since gaining independence in 1974 at the end of eleven years of war, Guinea-Bissau's army and state have remained in constant conflict, and no president has completed a full term in office. Late President Malam Bacai Sanho of the African Party for the Independence of Guinea-Bissau and Cape Verde (PAIGC) was elected in July 2009 with 63.52 percent of the vote against former president and leader of the Social Renovation Party (PRS) Kumba Yalo. The election followed the assassination of then president Jolo Bernardo Vieira by the military. Considered peaceful, free, and transparent, the 2009 presidential election was expected to stabilize the political and security environment. However, tension between the President and the Prime minister, and President Sanhnos regular shuttles between hospitals in Europe and Africa, sustained instability in a country weakened by drug cartels which use it as a hub to traffic drugs to Europe. On 18 March 2012, following the death of President Sanho two years into his term, new elections were held, which opposed nine candidates including former president Kumba Yalo. Prime Minister Carlos Gomes Junior, who ran for the PAIGC, received 49 percent of the votes, failing to secure a first-round victory. His main rival, Kumba Yalo, received 23 percent of the votes, and was expected to face Gomes in the run-off election. Kumba Yalöoimmediately announced he would boycott the run-off, claiming the ruling party had rigged the first-round. And on April 12, ex-Prime Minister Gomes Junior, who was expected to win the April 29 run-off election, was arrested, together with the interim President Raimundo Pereira, in a military coup. Gomes Junior was unpopular with the military since he supported an initiative to reform and downsize the army. The 15-nation Economic Community of West African States (ECOWAS) has condemned the coup and called for a return to constitutional rule. Meanwhile, the <q>military command</q> - as the rebel troops have named themselves - and opposition parties have agreed to set up a two-year National Transitional Council to run the country before new presidential and legislative elections. ECOWAS also decided to send a contingent to Guinea-Bissau and announced diplomatic, economic and financial sanctions following the juntas rejection of the regional blocs decision."
    },
    {"format":0,
     "iso":"CIV",
     "country":"Cote d'Ivoire",
     "upcoming":"",
     "recent":"- December 11, 2011: Leislative",
     "current_hos":"President Alassane Outtara (assumed office December 4, 2010 (1st term))",
     "current_hog":"Prime Minister Guillaume Soro (assumed office 4-Apr-07)",
     "description":"Cote d'Ivoire emerges from a violent post-election crisis which ended with the arrest of former president Laurent Gbagbo in April 2011, following his refusal to cede power after his defeat in the November 2010 run-off presidential election. Originally scheduled to be held in 2005, the vote was delayed several times due to the civil war and difficulties with the organization and preparation of the election. President Alassane Ouattara won the election with 54.1% of the vote. Restoring security, ensuring economic recovery, accountability for widespread human rights violations and promoting reconciliation are some of the key challenges facing President Ouattara. The new government is comprised of all political parties except Mr. Gbagbo's Ivorian Popular Front (FPI), which had chosen not to participate. For the December 2011 elections, the country's first parliamentary election since 2000, 5.7 million voters had registered to choose among one thousand candidates from thirty five political parties contesting the 255 National Assembly seats. Coming months after the country ended violence following the presidential polls in November 2010, the vote was seen as an important step towards democratic consolidation, good governance, as well as Cote d'Ivoires national reconciliation and economic recovery. However, it was boycotted by the FPI, more so following Laurent Gbagbo's transfer to the International Criminal Court in The Hague on November 30, on accusations of crimes against humanity during the post-election crisis that caused about 3,000 deaths. Despite localized incidents which claimed some casualties, and a low turnout estimated at 36.56%, the election was free, fair and generally peaceful. The presidential coalition was set for a landslide win and President Ouattara's Rally of Republicans (RDR) secured 80% of the vote or 127 of the 254 contested seats, pending a by-election for one seat. Its ally, the Ivory Coast Democratic Party (PDCI) of former president Henri Konan Bedi_ obtained 77 seats, and the independents, 35 seats. The results of the election will be certified by the Special Representative of the United Nations Secretary-General for Cote d'Ivoire after all electoral disputes have been examined by the Constitutional Council."
    },
    {"format":1,
     "iso":"KEN",
     "country":"Kenya",
     "upcoming":"- March 4, 2013: Presidential/Parliamentary",
     "recent":"",
     "current_hos":"President Mwai Kibaki (assumed office December 30, 2002 (2nd term))",
     "current_hog":"Prime Minister Raila Odinga (assumed office 17-Apr-08)",
     "description":"Kenya held Presidential, National Assembly and local elections on March 4, 2013 amidst fear of a recurrence of the violence which followed the disputed election result in 2007.  Elections had been due to be held in August 2012 but were delayed in order to allow new electoral procedures to be implemented. In December 2007 a close victory for Mwai Kibaki resulted in widespread ethnic violence and over 1,200 deaths after Mr. Kibaki claimed a narrow victory in a run-off against Raila Odinga.  Mr. Odinga was made Prime Minister under the brokered peace agreement and stood in the recent 2013 elections for the Coalition for Reforms and Democracy (CORD) against former deputy Prime Minister Uhuru Kenyatta of The National Alliance Party (TNA). Mr. Kenyatta is accused of inciting the violence in the aftermath of the 2007 elections and has been indicted by the International Criminal Court (ICC) for crimes against humanity, as has his running mate in 2013, William Ruto who supported Mr. Odinga in 2007. Since 2007, Kenya has adopted a new constitution, introduced voting reform and sought to moderate the power of the Presidential office by devolving power to local elected officials.  The new constitution adopted in 2010 made provision for 47 new administrative districts and these county level positions were a critical part of the 2013 election.  Also enshrined in the reforms was the requirement for presidential candidates to obtain at least 25 percent of the votes cast in 24 of the 47 counties in order to ensure that the winning candidate has support across a number of different regions and groups. In a show of unity Uhuru Kenyatta and William Ruto stood on a joint ticket as Presidential and Vice Presidential candidates respectively under the banner of the Jubilee Alliance, against Raila Odinga and Kalonzo Musyoka, and four other candidates.  The campaign was fought amid concerns that Mr. Kenyatta's ICC indictment would distract him from effectively carrying out his responsibilities as President, however the electorate did not share these fears and elected him with 50.07 percent of the vote, just 8,100 more votes than the 50 percent required to avoid a run-off, and carried 31 percent of the 47 counties.  The close result is contested by Mr. Odinga who secured 43.31 percent of the vote, 29 percent of the counties, and who has lodged a Supreme Court appeal alleging electoral fraud.  Despite this challenge, Mr. Odinga's legal recourse has been praised by observers in contrast to the violent recourse perpetrated in 2007. The overall turnout was over 86 percent of registered voters, with approximately 12.3 million votes cast. International observers have declared the election broadly free and fair with the deployment of approximately 90,000 police officers at polling stations ensuring there was minimal violence.  The new formed Independent Electoral and Boundaries Commission (IEBC) introduced electronic voting procedures which had mixed success but was supported by traditional paper based polling.  The new constitution also created the position of 'Women's Representative' in each of the 47 counties involving a record number of Kenyan women in representative politics."
    },
    {"format":0,
     "iso":"LSO",
     "country":"Lesotho",
     "upcoming":"",
     "recent":"- May 26, 2012: Parliamentary",
     "current_hos":"King Letsie III (assumed office February 7, 1996 (unelected))",
     "current_hog":"Prime Minister Pakalitha Mosisili (assumed office 29-May-98)",
     "description":"The landlocked country of Lesotho conducted a keenly contested parliamentary election on May 26, 2012. Fifteen political parties and several independent candidates fielded candidates for the 120 parliamentary seats, of which 80 were contested on a first past the post system, and 20 on a proportional representation system. The major contest opposed former Prime Minister Pakalitha Mosisili, in office since 1997, who contested on the platform of his newly-formed Democratic Congress party after abandoning his former party, the Lesotho Congress for Democracy, and Motsoahae Thomas Thabane, who contested on the platform of the All Basotho Convention. Pakalitha Mosisili's Democratic Congress Party won 48 seats; the All Basotho Convention won 30 seats; and the Lesotho Congress for Democracy won 26 seats. A major criticism of the election campaign was the failure of the candidates to discuss pertinent issues confronting the country; instead they focused on personalities issues. Lesotho has one of the world's highest HIV/AIDS prevalence rate with one in four persons living with the HIV virus. A further complication is the problem of poverty which is compounded by high unemployment rates and has rendered many people in the rural areas helpless. Economic downturn in South Africa which totally surrounds Lesotho has seen Lesotho workers, especially miners, losing their job in South Africa. During the campaign period, Archbishop Desmond Tutu was able to extract a pledge from all the political leaders in sustaining peace and respecting the results of the election. Observer missions were sent by the African Union, the Southern African Development Community and the Commonwealth. The observers noted that though the election was peaceful and credible, some areas needed improvement. They include bias on the part of the media, improvement in the voters register, the use of government's vehicles strictly for election purposes rather than for transporting ministers, and adherence to the electoral code of conduct. Despite winning the highest number of seats, Pakalitha Mosisili's party was not able to secure the absolute majority of 61 seats to form a government; a consequence of Lesotho's mixed member proportional electoral model, which was introduced in 2002 to increase parliament's inclusiveness and limit post-electoral contestations. After the failure of former Prime Minister Mosisili to form a coalition government, the leader of the All Basotho Convention, Thomas Thabane, announced that his party had reached an agreement with the Lesotho Congress for Democracy and two other parties to form a coalition government. Prime Minister Mosisili announced his resignation and Thomas Thabane was sworn in as the Prime Minister."
    },
    {"format":0,
     "iso":"LBR",
     "country":"Liberia",
     "upcoming":"",
     "recent":"- August 23, 2011: Constitutional referendum<br>- October 2011: Presidential/Legislative<br>- November 8, 2011: Presidential (2nd round)",
     "current_hos":"President Ellen Johnson-Sirleaf (assumed office January 16, 2006 (1st term))",
     "current_hog":"n/a",
     "description":"On 23 August 2011, a constitutional referendum, the second in Liberias existence since 1847, was organized to shorten the residency requirement for the president and vice-president from ten to five years; increase the mandatory retirement age for all justices to seventy-five; move the date of elections for the presidency and National Assembly to the second Tuesday of November; and to change the electoral system for the presidency and National Assembly. The referendum went well despite calls for boycott from the opposition CDC on the grounds that all the propositions on the ballot unduly favored the ruling Unity Party. However, due to fewer turnouts than the required constitutional two-thirds majority of registered voters, the poll failed in all its four propositions. In October and November 2011, Liberia held its second post-conflict elections after the end of the fourteen-year civil war in 2003. President Ellen Johnson Sirleaf of the Unity Party (UP), who became the first democratically-elected female African head of state in January 2006 and was awarded a shared Nobel Peace prize one week before the poll, was re-elected to a second term with 90.7% of the votes, against 9.3% to her main opponent Winston Tubman of the Congress for Democratic Change (CDC) and fourteen other candidates. At the end of the elections first round, the two main contenders had totaled 76% of the votes, 44% won by the incumbent. Before the election runoff on November 8 and despite the Chairperson of the National Elections Commissions stepping down, Winston Tubman withdrew from the poll and called for a boycott over allegations of fraud. As a result, the second round recorded only 38.6% of participation of the 1.8 million Liberians who had registered to vote. Over two thousands local and international observers had been deployed to oversee the process and declared the vote generally free, fair and credible despite the violence and low turnout that affected the runoff. In the 73-member House of Representatives, UP won the largest number of seats (24) followed by CDC (11), followed by independents (9) and the Liberty Party (7). In the 30-member Senate, UP and the National Patriotic Party each won four seats, followed by CDC who took two of the fifteen seats opened for election. With no majority in parliament and re-elected with a low turnout in a highly divisive poll that was deemed to consolidate the fragile democracy, President Johnson Sirleaf has called for national reconciliation. She promised to reach out to opposition leaders to form an inclusive government. She also set up new institutions to promote peace and reconciliation, and investigate the violence that preceded the November runoff."
    },
    {"format":1,
     "iso":"MDG",
     "country":"Madagascar",
     "upcoming":"- May 8, 2013: Presidential",
     "recent":"- November 30, 2012: Presidential/Parliamentary",
     "current_hos":"President of the High Authority of Transition Andry Rajoelina (assumed office March 17, 2009 (1st term))",
     "current_hog":"Prime Minister Albert Camille Vital (assumed office 20-Dec-09)",
     "description":"In March 2009, the elected President Marc Ravalomanana was ousted by former mayor of Antananarivo, Andry Rajoelina, with military support. Mr. Rajoelina has since assumed power as the President of the High Authority of the Transition (HAT). The former President remains in exile and the parliament suspended. In November 2010, a constitutional referendum was voted on, which is part of a broader plan aimed at stabilizing the country. Among other things, the referendum reduced the minimum age for presidential candidates from 40 to 35 years of age, thus allowing  Andry Rajoelina, 36, to run. Both parliamentary and presidential elections have been postponed several times. Despite the Southern African Development Community (SADC) mediator's concern that the conditions for inclusive, free and fair elections were not fulfilled, the HAT has expressed its resolve to hold elections to resolve Madagascar's crisis. Aside from Rajoelina, the main candidates for the presidential election are former Presidents Marc Ravalomanana (in exile in South Africa and restricted from returning until the country is stable), Didier Ratsiraka and opposition leader Albert Zafty, although the latter two have not officially announced their candidacy and have previously expressed their dissatisfaction with the transitional process. The presidential election is now seen as a key test of President Andry Rajoelina's commitment to the democratic process."
    },
    {"format":1,
     "iso":"MLI",
     "country":"Mali",
     "upcoming":"- April 2013: Presidential (first round)<br>- May 2013: Presidential (second round)<br>- July 2013: Parliamentary (first round)<br>- July 2013: Parliamentary (second round)",
     "recent":"",
     "current_hos":"President Dioncounda Traore (interim) (assumed office April 12, 2012 (1st term))",
     "current_hog":"Prime Minister Cheick Modibo Diarra  (assumed office 12-Apr-12)",
     "description":"Mali is a constitutional democracy with a unicameral National Assembly. Since the countrys first multi-party elections in 1992, Malians have held four sets of presidential and legislative elections that were deemed credible by domestic and international observers. President Toure was elected in 2002, supported by a coalition of the Alliance for Democracy in Mali (ADEMA) and all other Malian parties. After two 5-year terms, he was due to step down in 2012, leaving ADEMA, and three other main political groupings to each decide on its own candidate. Five weeks before the election, President Toure was ousted by a military coup led by Capt. Amadou Sanogo. Constitutional order was reestablished following regional and international pressure and Dioncounda Traore, the national assembly speaker, was appointed interim president. While the military had justified the coup to help fight off Tuareg rebels in the north, many of whom had returned from Libya after the fall of the late Libyan leader Muammar Gaddafi, the takeover has, in fact, facilitated further insurgency and the declaration of independence of Azawad in the north by the Malis National Movement for the Liberation of Azawad (MNLA). The Economic Community of West African States (ECOWAS) decided to send a regional military force in Mali. ECOWAS also decided that presidential and legislative elections should be organized at the end of a twelve-month transition period."
    },
    {"format":0,
     "iso":"MRT",
     "country":"Mauritania",
     "upcoming":"",
     "recent":"- May 12, 2012: Legislative (postponed)",
     "current_hos":"President Mohamed Ould Abdel Aziz (assumed office August, 5, 2009 (1st term))",
     "current_hog":"Prime Minister Moulaye Ould Mohamed Laghdaf   (assumed office 14-Aug-08)",
     "description":"Mauritania is a highly centralized Islamic republic. A military coup ousted the country's first democratically elected leader in 2008, a consensual agreement in June 2009 ended the country's political stalemate, and presidential election elections in July 2009 helped to stabilize the political situation. President Mohamed Ould Abdel Aziz, who had stepped down as the head of the military junta to stand as candidate, was elected with 52.58% of the vote. The Parliament is comprised of the Senate or Majlis al-Shuyukh (56 seats with 53 members elected by municipal leaders and 3 members elected for Mauritanians abroad to serve six-year terms) and the National Assembly or Al Jamiya Al Wataniya (95 seats with members elected by popular vote to serve five-year terms). The ruling Union for the Republic (Union pour la R_publique or UPR) coalition holds 64% of the seats in the National Assembly and 80% of the seats in the Senate. However, following protest movements by youth agitating for greater political freedom and general improvements in living conditions, opposition parties have begun repositioning themselves in preparation for the October 2011 election. Initially scheduled for late 2011, the parliamentary election has been postponed several times."
    },
    {"format":1,
     "iso":"MUS",
     "country":"Mauritius",
     "upcoming":"- 2013: President (indirect)",
     "recent":"",
     "current_hos":"President Kailash Purryag (assumed office July 21, 2012 (1st term))",
     "current_hog":"Prime Minister Navin Ramgoolam (assumed office 5-Jul-05",
     "description":"n/a"
    },
    {"format":0,
     "iso":"MAR",
     "country":"Morocco",
     "upcoming":"",
     "recent":"- November 25, 2011: Parliamentary",
     "current_hos":"King Mohammed VI (assumed office July 23, 1999 (unelected))",
     "current_hog":"Prime Minister Abdelilah Benkirane (assumed office 29-Nov-11)",
     "description":"Morocco is a constitutional monarchy and King Mohamed VI succeeded his father in July 1999. Following the events that occurred in Libya, Egypt, Tunisia and Yemen, King Mohammed VI announced, in March 2011, a referendum on political reform that was held in July. He handed over more powers to the government, although he retains the final say on the economy, security and religion. Initially planned for September 2012, early parliamentary elections were held on November 25. The vote was seen as a test of the king's response to the Arab Spring. 13.6 million Moroccans representing 45% of the eligible voters turned out to elect a new legislature, despite calls for a boycott from a minority group known as the February 20 Movement for Change. 5,873 candidates from 31 parties ran for election and 30 seats of the 395-seat Chamber of Representatives are reserved for women. Observers judged the elections well organized and transparent. The moderate Islamist group, the Justice and Development Party (PJD), mainly supported by Morocco's poor, achieved the majority of the parliamentary seats, winning 107 seats or 27.1% of the vote. PJD does not hold an outright majority in the House, indicating that it will have to enter into a coalition government with certain opposition parties. After the Ennahda party in Tunisia, PJD became the 2nd moderate Islamic to lead a North African government since the start of the Arab Spring uprisings. In second position, the National Istiqlal Party, headed by outgoing Prime Minister Abbas Al Fassi, won 60 of the 395 seats, while the Union of Progressive Socialist Forces captured 39 seats and the former communist party took 18 seats. In the wake of the election and the confirmation of the make-up of the new parliament, King Mohammed appointed PJD secretary general Abdelilah Benkirane as the country's new Prime Minister. The new government is poised to address the current economic and social challenges facing Morocco, namely youth unemployment, corruption and poverty."
    },
    {"format":1,
     "iso":"MOZ",
     "country":"Mozambique",
     "upcoming":"- 2013: Local",
     "recent":"",
     "current_hos":"President Armando Guebuza (assumed office February 2, 2005 (1st term))",
     "current_hog":"Prime Minister Aires Ali (assumed office 16-Jan-10",
     "description":"n/a"
    },
    {"format":0,
     "iso":"NER",
     "country":"Niger",
     "upcoming":"",
     "recent":"- January 31, 2011: Presidential (1st round)/National Assembly<br>- March 12, 2011: Presidential (2nd round)",
     "current_hos":"President Mohamadou Issoufou (assumed office April 7, 2011 (1st term))",
     "current_hog":"Prime Minister Brigi Rafini (assumed office 7-Apr-11)",
     "description":"In February 2010, Niger went through a coup d'etat following former President Mamadou Tandja's attempt to expand his power and extend his ten-year rule. The constitution was suspended and the National Assembly dissolved. The military junta vowed to organize elections and restore civilian rule within a year following the coup. After being postponed due to financial constraints and internal problems within the National Independent Electoral Commission (CENI), the presidential election run-off took place on 12 March 2011. President Mohamadou Issoufou won 58% of the vote, which was accepted by his opponent and led the way to a successful transition from military rule to an elected government."
    },
    {"format":0,
     "iso":"NGA",
     "country":"Nigeria",
     "upcoming":"",
     "recent":"- April 9, 2011: House of Representatives and Senate<br>- April 16, 2011: Presidential<br>- April 26, 2011: State Assemblies and Governors",
     "current_hos":"President Goodluck Jonathan (assumed office May 6, 2010 (2nd term))",
     "current_hog":"n/a",
     "description":"For three consecutive weeks in April 2011, Nigerians went to the polls and voted respectively for parliament officials, a new president, and for state governors. The presidential election presented the highest stake, following on the heels of the near crisis which followed the death of former President Umaru Yar'Adua and subsequent appointment of then Vice-President Jonathan to the presidency in 2010, as well as 2007 elections that were considered fraudulent. President Jonathan's decision to run for the presidency created controversy by its own right, since his candidacy violated a <q>gentlemen's agreement</q> within the ruling People's Democratic Party (PDP) establishing an alternating power sharing scheme between Muslim north and Christian south every two terms. Mr. Yar'Adua had only served one of the two possible terms as President. The April 16 2011 presidential election was considered the most successful in decades. President Jonathan won the election with 58.89% of the vote against a northern Muslim, General Muhammadu Buhari. Revealing a geographical divide between North and South, the election results have been followed by widespread violence through northern Nigeria."
    },
    {"format":1,
     "iso":"RWA",
     "country":"Rwanda",
     "upcoming":"- 2013: Cahamber of Deputies",
     "recent":"- September 26-27, 2011: Senate",
     "current_hos":"President Paul Kagame (assumed office March 24, 2000 (3rd term))",
     "current_hog":"Prime Minister Bernard Makuza (assumed office 8-Mar-00)",
     "description":"In August 2010, President Paul Kagame was re-elected to a second 7-year term with 93.1% of the vote. The pre-election period was marked by political and security concerns, while the media faced increased restrictions. The Rwandan Chamber of Deputies is the first national legislature in the world with a female majority. In the September 2008 elections, women secured 45 out of 80 seats, or 56.2% of the vote. In the Senate, women represent 34.62% of the 26 members."
    },
    {"format":0,
     "iso":"STP",
     "country":"Sao Tome and Principe ",
     "upcoming":"",
     "recent":"- July 17, 2011: Presidential (1st round)<br>- August 7, 2011: Presidential (2nd round)",
     "current_hos":"President Manuel Pinto da Costa (assumed office September 3, 2011 (1st term))",
     "current_hog":"Prime Minister Patrice Emery Trovoada (assumed office 10-Aug-10)",
     "description":"A multiparty constitutional democracy, Sao Tome and Principe has a unicameral National Assembly. President Fradique de Menezes was re-elected in 2006 to a second and final five-year term. Prime Minister Patrice Trovoada was appointed in August 2010, after his Independent Democratic Action (ADI) party won parliamentary elections. On 7 August, Manuel Pinto Da Costa, who ruled the country for its first 15 years of independence between 1975 and 1991, defeated Parliament Speaker Evaristo de Carvalho with 52.88% of the vote to 47.12%. Carvalho, a former prime minister, was the candidate of the Independent Democratic Action (ADI) party, which won the 2010 parliamentary election."
    },
    {"format":0,
     "iso":"SEN",
     "country":"Senegal",
     "upcoming":"",
     "recent":"- February 26, 2012: Presidential (first round)<br>- March 25, 2012: Presidential (second round)<br>- July 1, 2012: Legislative",
     "current_hos":"President Macky Sall (assumed office April 2, 2012 (1st term))",
     "current_hog":"Prime Minister Abdoul Mbaye (assumed office 2-Apr-12)",
     "description":"Senegal is a multiparty democracy and a moderate Muslim country. It is one of the few African states that have never experienced a coup d'etat. At 85, former President Abdoulaye Wade's decision to seek a third term in the February 2012 presidential election, despite pressure from opposition leaders who had accused him of bending constitutional rules to run again, rose tension in the run-up to the vote. His failure to curb power cuts and soaring food and fuel prices, as well as his decision to appoint his son Karim to key positions in government further angered voters. Moreover, one month before the election, the constitutional court decided that the term limit, which came in before the constitution was changed, should not apply to Mr. Wade's first term. The first round of the presidential election was highly polarized, with repeated incidences of violence which caused the death of at least six people. Mr Wade fell short of a majority, polling only 34.8%. Mr. Macky Sall came second with 26.6%. Mr. Sall, 50, was President Wade's Prime Minister until their relationship broke down in 2008, leading to an acrimonious split with the ruling party. On March 25, unlike the first round of the presidential election, the runoff took place in a peaceful atmosphere. Most of the 12 other presidential candidates backed Mr Sall in the second round, who was largely elected with 65% of the votes against Mr. Wade at 35%. Outgoing President Wade was hailed for conceding defeat to the opposition leader, a gesture seen as contributing to the consolidation of democracy in Senegal. On July 1, four months after the presidential election, Senegalese went back to the polls to elect 150 members of the National Assembly 90 through direct suffrage and 60 chosen from party lists. About 5 million of the 13 million population registered to choose among twenty-four parties and coalitions or 7,200 candidates who were cleared to contest. These included a higher number of women after a law requiring gender parity on all political party lists was enacted in May 2010. A former member of the Movement of Democratic Forces of Casamance (MFDC) which is fighting for the independence of southern Senegal also stood for election, and, for the first time, a number of local Islamic leaders. Following a peaceful campaign, voters showed less enthusiasm than for the presidential election and turnout culminated at 37%. President Sall had called on voters to give him a large majority for him to be able to 'resolutely get to work', and the election was seen as a popularity test for the newly-elected president. His coalition, Benno Bokk Yakaar (United in Hope), won a controlling majority of 119 of the 150 seats. The Senegalese Democratic Party (PDS) of former President Abdoulaye Wade won only 12 seats, while a breakaway PDS faction garnered four seats; and other smaller political parties, including religious parties, shared the remaining 15 seats. 64 women were elected up from 34 in the precedent assembly bringing Senegal to a decisive 44.6 per cent of female representation in Parliament. President Sall's victory will enable him to implement the necessary reforms to redress the country's various socio-economic challenges including a budget deficit equal to 8 percent of the gross domestic product, high unemployment and rising commodity prices, and breakdowns in electricity supplies to name a few."
    },
    {"format":0,
     "iso":"SYC",
     "country":"Seychelles ",
     "upcoming":"",
     "recent":"- May 2012: Legislative",
     "current_hos":"President James Michel (assumed office April 16, 2004 (2nd term))",
     "current_hog":"n/a",
     "description":"Seychelles has a multiparty system since the adoption of a new constitution in 1993. President Michel was first elected in 2006 during elections considered credible despite complaints of unfair campaign practices. In May 2011, he was re-elected in the first election round, winning 55.4% of the vote against his closest rival, Wavel Ramkalawan who won 41.4% of the vote. Polling was peaceful and orderly despite accusations of bribing opposition voters not to vote and the denial of observer status by the Electoral Commissioner to all local observer applicants. President Michels re-election extends his Lepep Party's 34-year rule for another five years. In September-October 2011, Seychellois people went back to the poll to elect a new 31-seat National Assembly, following the opposition boycott of the Assembly in July 2011, which culminated in its dissolution. The election was boycotted by the main opposition Seychelles National Party (SNP) and the New Democratic Party (NDP). A small breakaway faction within the SNP, the Popular Democratic Movement (PDM), contested the election. However, despite garnering 9.6% of the vote, the newly formed party was unable to secure any Parliamentary seats. Lepep Party won an overwhelming majority of 88.56% of the vote garnering all the 25 directly elected seats. Lepep party also won an additional 6 seats allocated on the basis of proportional representation, which allows it to control the entire National Assembly. The election saw one of Seychelles lowest voter turnouts in its electoral history at 74.3%, at 11% less than the May 2011 presidential elections."
    },
    {"format":0,
     "iso":"SLE",
     "country":"Sierra Leone",
     "upcoming":"",
     "recent":"- November 7, 2012 : Presidential/Legislative",
     "current_hos":"President Ernest Bai Koroma (assumed office September 17, 2007 (1st term))",
     "current_hog":"n/a",
     "description":"Sierra Leone is a constitutional republic with a unicameral legislature. The 2007 elections saw a peaceful power alternation in favor of then opposition All Peoples Congress. President Ernest Bai Koroma won the presidential election with 54.6% of the vote. However, due to rising political tensions, questions remain whether the coming 2012 Parliamentary and Presidential elections will be equally peaceful."
    },
    {"format":0,
     "iso":"SOM",
     "country":"Somalia",
     "upcoming":"",
     "recent":"- 2012: House of Representatives and Loca",
     "current_hos":"Sheikh Sharif Sheikh Ahmed (Somalia); President Ahmed Mohamed Mahamoud (Somaliland) (assumed office January 1, 2009 (1st term)/July 27, 2010 (1st term))",
     "current_hog":"Prime Minister Mohamed Abdullahi Farmajo (Somalia); Vice-President Abdirihman Abdillahi Ismail (Somaliland) (assumed office June 28, 2011/December 1, 2004)",
     "description":"Without a functioning central government since 1991, Somalia is engaged in a civil war among rival warlords and clans. A transitional government, established in 2004 and backed by approximately 9,000 African Union troops, has also been fighting the al Qaeda-linked insurgent group Al-Shabab. Required to deliver a new constitution and national elections by August 2011, the Transition Federal institutions (TFIs) have been unsuccessful on both counts. In June 2011, squabbling leaders of the TFIs agreed to postpone national elections until August 2012, to help the government deal with security and political issues. The deal signed by President Ahmed and Speaker Sharif Hassan Sheik Aden also calls for popular Prime Minister Mohamed Abdullahi Mohamed to resign within 30 days and allow the formation of a new government that will guide the country's transition and prepare it for new elections. Though not recognized by the international community, the former British Somaliland seceded from the rest of Somalia in May 1991, and a stable government has been set up. In 2010, Somaliland presidential election saw a peaceful transfer of power among political parties. In Northeast Somalia, Puntland State declared in 1998 that it would remain autonomous until a federated Somalia state is established."
    },
    {"format":0,
     "iso":"ZAF",
     "country":"South Africa",
     "upcoming":"",
     "recent":"- May 18, 2011: Local",
     "current_hos":"President Jacob Zuma (assumed office May 9, 2009 (1st term))",
     "current_hog":"n/a",
     "description":"South Africa is a federal parliamentary representative democratic republic, wherein the President, elected by parliament, is the head of government. General elections are held every 5 years and the first fully multi-racial democratic election was held in 1994. Since the end of apartheid, South Africa's politics has been dominated by the African National Congress (ANC). The ANC continues to enjoy widespread support among the population, though South Africa's opposition Democratic Alliance increased its share of the vote in the May 2011 fourth local government elections. The ANC remains the ruling party in eight of the nine provinces, having received 62.9% of the popular vote in the 2011 municipal election."
    },
    {"format":0,
     "iso":"SDN",
     "country":"Sudan",
     "upcoming":"",
     "recent":"- January 9, 2011: Southern Sudan Referendum",
     "current_hos":"President Omar al-Bashir (assumed office June 30, 1989 (5th term))",
     "current_hog":"n/a",
     "description":"The April 2010 presidential and regional elections were meant to move Sudan further on the way to democracy. The polls were criticized by a number of opposition parties and international observers for being flawed. At national level, President Bashir, who came to power in a coup in 1989, was elected with 68.2% of the vote, defeating other eleven presidential candidates. Some opposition parties, including the Sudan People's Liberation Movement (SPLM), boycotted the elections in the north. In the south, the incumbent President, Salva Kiir Mayardit won the regional election with 93% of vote. President Bashir's National Congress Party (NCP) won 72% of the seats of the National Assembly. Implementation of the Comprehensive Peace Agreement continued in January 2011 with the referendum on Southern Sudan's independence. The process was largely peaceful and well-organized and 98.83% of Southern Sudanese voted in favor of independence. A simultaneous referendum, which was supposed to be held in Abyei on whether to become part of Southern Sudan, was postponed due to conflict over demarcation and residency rights. In the eve of South Sudan's independence, the political situation continues to be volatile with unresolved disputes over borders and resources and the seizure of Abyei by the north in May 2011; sporadic incidents of violence in the South; the dramatic increase in attacks on civilians by rebels and the Sudanese government in Darfur despite the Doha peace talks; as well as the status of the Nuba Mountains regions of South Kordofan and Blue Nile."
    },
    {"format":1,
     "iso":"SWZ",
     "country":"Swaziland",
     "upcoming":"- 2013: House of Assembly and local",
     "recent":"",
     "current_hos":"n/a",
     "current_hog":"n/a",
     "description":""
    },
    {"format":0,
     "iso":"TGO",
     "country":"Togo",
     "upcoming":"",
     "recent":"- October 2012: Legislative<br>- 2012: Legislative",
     "current_hos":"President Faure Gnassingbe (assumed office May 4, 2005 (1st term))",
     "current_hog":"Prime Minister Gilbert Houngbo (assumed office 8-Sep-08)",
     "description":"In February 2005, Faure Gnassingb_ was sworn in as President following the death of his father President Gnassingbe Eyadema, after 38 years in power. Unanimously condemned by African leaders and the international community, this unconstitutional move led to a presidential election in April 2005. Accompanied by widespread accusations of fraud, voter intimidation and violence, the election saw the victory of President Faure Gnassingb_. He was reelected in March 2010 with 60.9% of the vote. The election was considered generally free and fair. The last legislative election was held in October 2007. It saw the participation of all opposition parties for the first time in 17 years. The ruling Rally of the Togolese People (RPT) won 50 of the 81 National Assembly seats; the Union of Forces for Change (UFC) of veteran opposition leader Gilchrist Olympio took 27 seats, with the Action Committee for Renewal (CAR) CAR receiving the remaining 4. In May 2011, the adoption of a controversial law governing protests and demonstrations; and the severe repression of student demonstrating against their poor conditions, changes to the curriculum and the late payment of grants, raised concerns about popular and political party demonstrations in preparation for the legislative election in 2012."
    },
    {"format":0,
     "iso":"TUN",
     "country":"Tunisia",
     "upcoming":"",
     "recent":"- October 23, 2011: Constituent Assembly",
     "current_hos":"President a.i Foued Mebazaa (assumed office January 15, 2011 (1st term))",
     "current_hog":"Prime Minister Hamadi Jebali (assumed office 27-Feb-11)",
     "description":"Former President Zine el Abidine Ben Ali was forced out of power in January 2011 by the Jasmine Revolution and Tunisia held its first open and competitive election in decades -- the first vote of the Arab spring -- on October 23. The election put an end to the revolution while giving legitimacy to new state institutions and establishing the foundations for political reform. The 217-member National Constituent Assembly election is tasked with forming a new government, rewriting the constitution, and paving the way for parliamentary and presidential elections, most likely to be held in the first half of 2012. Over 90% of the 4.1 million registered voters took part in the elections which were considered free and fair. Ennahda (Renaissance) party, a once-banned moderate Islamist party, expectedly won the poll with 41% of the votes and 90 out of 217 seats in the assembly. In a country known for decades for its repressive leadership but also for its progressive legislation on women and families, Ennahda believes Islam should be the reference point for the country's system and laws. Thus, concerns remain despite the party's promises to protect human rights and the rights of women, and to maintain equality. The two Centre-Left parties, the Congress for the Republic and Ettakatol (the Democratic Forum for Labour and Freedoms), which took respectively 30 and 21 seats in the Assembly, formed a coalition with the winner, as they share some consensus on the need to maintain a reasonably strong social welfare program with. Veteran human rights campaigner and leader of the Congress for the Republic, Moncef Marzouki was elected president of Tunisia by the newly-elected assembly, after winning the support of the Islamist party Ennahda. Under the deal, Ettakatol leader Mustafa Ben Jaafar became president of the assembly, and Ennahda secretary general, Hammadi Jebali, was appointed prime minister. In the region, Tunisia's path forward is under scrutiny after it set off the Arab Spring and inspired similar pro-democracy movements in Egypt and later in Libya. Moreover, Ennahda's victory is anticipated to have wide implications for similar religious parties."
    },
    {"format":0,
     "iso":"UGA",
     "country":"Uganda",
     "upcoming":"",
     "recent":"- February 18, 2011: Presidential/National Assembly/Local",
     "current_hos":"President Yoweri Museveni (assumed office January 26, 1986 (4th term))",
     "current_hog":"Prime Minister Amama Mbabazi (assumed office 24-May-11)",
     "description":"After lifting a two-term limit on the presidency in order to run again in 2006, President Yoweri Museveni was reelected in February 2011, winning 68.3 % of the vote, extending his 25 year rule. In the 332 seat National Assembly, the ruling National Resistance Movement (NRM) obtained a resounding majority, winning 279 seats. Other parties represented in parliament include the Forum for Democratic Change (FDC) led by Kifeefe Kizza Besigye (34 seats), the Democratic Party (DP) led by Norbert MAO which won 11 seats; and Olara Otunnu's Uganda People's Congress (UPC) (9 seats). Opposition leaders rejected the election results, claiming the elections were not free and fair. They called for public protests, which were not widely attended by protesters. However, the February 2011 elections were followed by weeks of violently repressed unrest and a wave of opposition protests over rising prices."
    },
    {"format":0,
     "iso":"ZMB",
     "country":"Zambia",
     "upcoming":"",
     "recent":"- September 20, 2011: Presidential/Legislative",
     "current_hos":"President Michael Sata (assumed office September 23, 2011 (1st term))",
     "current_hog":"n/a",
     "description":"Zambia held presidential and legislative elections on September 20, 2011. The contest was a rematch of the 2008 presidential election in which incumbent president Rupiah Banda from the Movement for Multiparty Democracy (MMD) faced his main challenger, Michael Sata of the Patriotic Front (PF). After four runs for the office, the election named Michael Sata the winner with 43% of the vote against the incumbent's 36.1%. Known for his populist anti-China rhetoric, Mr. Sata is said to have benefited from the votes of disgruntled Copper Belt workers as well as urban impoverished youths. Sata's FP disputed media reports that it is anti-Chinese. However, his victory is likely to change the way contracts are awarded and reflects the increased interest of Zambians to transparency and accountability.  This could thus cloud Chinese investments in the Southern African country.  Zambia has a unicameral National Assembly with 150 seats.  In the recent parliamentary elections, The PF took 60 seats, eight of them by women. MMD won 55 seats, six by women. The third largest party, the United Party for National Development (UPND) won 28 seats with 2 female MPs. The remaining seats were distributed among smaller parties and three independent members of parliament."
    },
    {"format":1,
     "iso":"ZWE",
     "country":"Zimbabwe",
     "upcoming":"- 2013: Legislative (tentative)",
     "recent":"",
     "current_hos":"President Robert Mugabe (assumed office December 31, 1987 (5th term))",
     "current_hog":"Prime Minister Morgan Tsvangirai (assumed office 11-Feb-09)",
     "description":"The presidential election in 2002, the parliamentary elections in 2005, as well as the harmonized presidential and parliamentary elections of March 2008 and the presidential run-off of June 2008 were all considered highly flawed. Although opposition Movement for Democratic Change (MDC) gained a parliamentary majority in March 2008, candidate Morgan Tsvangirai withdrew from the June 2008 presidential run-off due to post-election violence. A Global Political Agreement was signed in September 2008, paving the way to a shaky transitional government of national unity and power sharing between President Mugabe and Prime Minister Tsvangirai. Calls by President Mugabe/'s ZANU-PF for early elections in 2011 raised concerns of increased numbers of cases of harassment and intimidation of civil society, humanitarian organizations and the media. At the same time, analysts called for preliminary constitutional reform, free media and improved voter registration. In September 2011, Mugabe, accusing his rivals of stalling the process to write a new constitution to prolong the fragile unity government, announced that elections would take place in early 2012."
    }
]